# ReverseIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DetailCurveArray..::..ReverseIterator Method
DetailCurveArray Class See Also
---
Retrieve a backward moving iterator to the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual DetailCurveArrayIterator ReverseIterator()
```

Visual Basic
---
```text
Public Overridable Function ReverseIterator As DetailCurveArrayIterator
```

Visual C++
---
```text
public:
virtual DetailCurveArrayIterator^ ReverseIterator()
```

# ### Return Value
Returns a backward moving iterator to the array.
# See Also
DetailCurveArray Class
Autodesk.Revit.DB Namespace